# Parameters
nc: 3  # number of classes
depth_multiple: 0.33  # model depth multiple
width_multiple: 0.50  # layer channel multiple
anchors:
  - [ 2,3, 3,7, 6,5 ]  # P3/8
  - [ 6,11, 13,7, 11,16 ]  # P4/16
  - [ 24,12, 20,25, 44,33 ]  # P5/32

# YOLOv5 v6.0 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Conv, [64, 6, 2, 2]],  # 0       2
   [-1, 1, Conv, [128, 3, 2]],    # 1       4
   [-1, 3, C3, [128]],            # 2
   [-1, 1, Conv, [256, 3, 2]],    # 3       8
   [-1, 6, C3, [256]],            # 4
   [-1, 1, Conv, [512, 3, 2]],    # 5       16
   [-1, 9, C3, [512]],            # 6
   [-1, 1, Conv, [1024, 3, 2]],   # 7       32
   [-1, 3, C3, [1024]],           # 8
   [-1, 1, CoordAtt, [1024]],     # 9
   [-1, 1, SPPF, [1024, 5]],      # 10
   [-1, 3 ,C3TR, [1024, False]]   # 11
  ]

# YOLOv5 v6.0 head
head:
  [[-1, 1, Conv, [512, 1, 1]],    # 12
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],
   [-1, 3, C3, [512, False]],
   [-1, 1, CBAM, []],

   [-1, 1, Conv, [256, 1, 1]],    # 17
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],    # 18
   [[-1, 4], 1, Concat, [1]],
   [-1, 3, C3TR, [256, False]],    # 20
   [-1, 1, CBAM, []],

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 17], 1, Concat, [1]],
   [-1, 3, C3TR, [512, False]],    # 24
   [-1, 1, CBAM, []],

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 12], 1, Concat, [1]],
   [-1, 3, C3TR, [1024, False]],   # 28

   [[20, 24, 28], 1, Detect, [nc, anchors]],
  ]
